# 1. Квадрат числа.
# Користувач вводить число. Програма виводить його квадрат.
# Приклад:
# Введіть число: 5
# Квадрат числа: 25
#
# num1 = int(input("Введіть число:"))
# num1 **= 2
# print("Квадрат введеного числа дорівнює " + str(num1))

# 2. “Середнє трьох чисел”
# Програма запитує три числа і виводить їх середнє арифметичне.
# Приклад:
# Введіть три числа: 2, 4, 6
# Середнє: 4.0
#
# num1 = int(input("Введіть число 1:"))
# num2 = int(input("Введіть число 2:"))
# num3 = int(input("Введіть число 3:"))
# avg_num = (num1 + num2 + num3) / 3
# print("Середнє арифметичне трьох введених чисел " + str(avg_num))

# 3. “Перетворення хвилин у години”
# Користувач вводить кількість хвилин. Програма виводить, скільки це годин і хвилин.
# Приклад:
# Введіть кількість хвилин: 135
# 2 години 15 хвилин
#
# total_minutes = int(input("Введіть кількість хвилин:"))
# hours = total_minutes // 60
# minutes = total_minutes % 60
# print(str(hours) + " години " + str(minutes) + " хвилин")

# 4. “Розрахунок знижки”
# Користувач вводить ціну товару і розмір знижки у %.
# Програма виводить кінцеву ціну.
# Приклад:
# Введіть ціну: 1000
# Введіть знижку (%): 15
# Ціна зі знижкою: 850.0
#
# price = int(input("Введіть ціну:"))
# discount_percent = int(input("Введіть знижку (%):"))
# discount_sum = price * discount_percent / 100
# total_price = price - discount_sum
# print("Ціна зі знижкою: " + str(total_price))

# 5. “Остання цифра числа”
# Користувач вводить ціле число, програма виводить його останню цифру.
# Приклад:
# Введіть число: 347
# Остання цифра: 7
#
# num1 = int(input("Введіть число:"))
# num1 %= 10
# print("Остання цифра: " + str(num1))

# 6. “Периметр прямокутника”
# Користувач вводить довжину і ширину. Програма виводить периметр.
# Приклад:
# Введіть довжину: 5
# Введіть ширину: 3
# Периметр: 16
#
# length = int(input("Введіть довжину:"))
# width = int(input("Введіть ширину:"))
# perimeter = length * 2 + width * 2
# print("Периметр прямокутника дорівнює " + str(perimeter))

# 7. Виведення числа в стовпчик
# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого друкує на екрані стовпчик цифр, з якого це число складається. Наприклад, користувач вводить 1234, а програма виводить:
# 1
# 2
# 3
# 4
# Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod). Виведення в стовпчик можна зробити за допомогою 4-х функцій print.
# Користувач може ввести будь-яке 4 значне ціле число. Будь-яке 4-х значне число - це число, яке складається з 4-х цифр, де кожна цифра може бути від 0 до 9 включно.
# Ваше рішення має це враховувати! Якщо користувач ввів не ціле число, це проблема користувача, а не вашої програми.
# Створюйте рішення, виходячи з того, що число ЗАВЖДИ 4-х значне.
#
# num4digit = int(input("Введіть 4-х значне число: "))
# num1of4 = num4digit // 1000
# num2of4 = num4digit // 100 % 10
# num3of4 = num4digit % 100 // 10
# num40f4 = num4digit % 10
# print(num1of4)
# print(num2of4)
# print(num3of4)
# print(num40f4)